Revit 2024 API
BeamSystem.Profile Property
Retrieve or set the profile of the BeamSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurveArray Profile { get; set; }
Visual Basic
Public Property Profile As CurveArray
	Get
	Set
Visual C++
public:
property CurveArray^ Profile {
	CurveArray^ get ();
	void set (CurveArray^ value);
}
See Also
BeamSystem Class
Autodesk.Revit.DB Namespace